In [1]:
import pandas as pd

In [4]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]

df = pd.DataFrame.from_dict(dict(friend_list))

In [5]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [8]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [9]:
df = df[1:3]

In [10]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [11]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]

df = pd.DataFrame.from_dict(dict(friend_list))

In [12]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [13]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [14]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

### by Column conditions

In [16]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [17]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [21]:
df[(df.age>25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

## Filter Column

### by index

In [22]:
friend_list = [
    ['Jon', 20, 'student'],
        ['Jenny', 30, 'developer'],
        ['Nate', 30, 'teacher']
]

In [23]:
df = pd.DataFrame.from_records(friend_list)

In [24]:
df

       0   1          2
0    Jon  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [25]:
df.iloc[:,0:2]

       0   1
0    Jon  20
1  Jenny  30
2   Nate  30

In [26]:
df.iloc[0:2,0:2]

       0   1
0    Jon  20
1  Jenny  30

## by column name

In [27]:
df = pd.read_csv('data/friend_list.csv')

In [28]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [29]:
df_filtered = df[['name','age']]

In [30]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [31]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [33]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [34]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [35]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [37]:
df.filter(regex='e$', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25